In [1]:
import numpy as np
import pandas as pd

In [2]:
from pandas import Series, DataFrame

In [3]:
obj = pd.Series([3,6,12,7],  index=["d", "b", "a", "c"])

In [4]:
obj

d     3
b     6
a    12
c     7
dtype: int64

In [5]:
obj.array

<PandasArray>
[3, 6, 12, 7]
Length: 4, dtype: int64

In [6]:
obj.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [7]:
obj2 = pd.Series([3,6,12,7],  index=["d", "b", "a", "c"])

In [8]:
obj2

d     3
b     6
a    12
c     7
dtype: int64

In [9]:
obj2['a']

12

In [10]:
obj2[obj2>3]

b     6
a    12
c     7
dtype: int64

In [11]:
np.exp(obj2)

d        20.085537
b       403.428793
a    162754.791419
c      1096.633158
dtype: float64

In [12]:
'b' in obj2

True

In [13]:
'e' in obj2

False

In [14]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}

In [15]:
obj3 = pd.Series(sdata)

In [16]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [17]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [18]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [19]:
states = ["California", "Ohio", "Oregon", "Texas"]

In [20]:
obj4 = pd.Series(sdata, index = states)

In [21]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [22]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [23]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [24]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [25]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [26]:
obj4.name = 'Population'

In [27]:
obj4.index.name = 'state'

In [28]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: Population, dtype: float64

In [29]:
obj

d     3
b     6
a    12
c     7
dtype: int64

In [30]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [31]:
obj

Bob       3
Steve     6
Jeff     12
Ryan      7
dtype: int64

In [32]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [33]:
frame = pd.DataFrame(data)

In [34]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [35]:
type(frame)

pandas.core.frame.DataFrame

In [38]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [39]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [41]:
pd.DataFrame(data, columns=['year', 'pop', 'state', 'country'])

   year  pop   state country
0  2000  1.5    Ohio     NaN
1  2001  1.7    Ohio     NaN
2  2002  3.6    Ohio     NaN
3  2001  2.4  Nevada     NaN
4  2002  2.9  Nevada     NaN
5  2003  3.2  Nevada     NaN

In [42]:
frame['state'
]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [43]:
frame.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [44]:
frame.loc[2]

state    Ohio
year     2002
pop       3.6
Name: 2, dtype: object

In [46]:
frame.iloc[2]

state    Ohio
year     2002
pop       3.6
Name: 2, dtype: object

In [47]:
frame['debt'] = 16.5

In [49]:
frame

    state  year  pop  debt
0    Ohio  2000  1.5  16.5
1    Ohio  2001  1.7  16.5
2    Ohio  2002  3.6  16.5
3  Nevada  2001  2.4  16.5
4  Nevada  2002  2.9  16.5
5  Nevada  2003  3.2  16.5

In [50]:
frame['debt'] = np.arange(6.)

In [51]:
frame

    state  year  pop  debt
0    Ohio  2000  1.5   0.0
1    Ohio  2001  1.7   1.0
2    Ohio  2002  3.6   2.0
3  Nevada  2001  2.4   3.0
4  Nevada  2002  2.9   4.0
5  Nevada  2003  3.2   5.0

In [52]:
frame.index

RangeIndex(start=0, stop=6, step=1)

In [53]:
val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])

In [54]:
frame[
    'debt'
] = val

In [55]:
frame

    state  year  pop  debt
0    Ohio  2000  1.5   NaN
1    Ohio  2001  1.7   NaN
2    Ohio  2002  3.6   NaN
3  Nevada  2001  2.4   NaN
4  Nevada  2002  2.9   NaN
5  Nevada  2003  3.2   NaN

In [56]:
frame['Eastern'] = frame['state'] == 'Ohio'

In [57]:
frame

    state  year  pop  debt  Eastern
0    Ohio  2000  1.5   NaN     True
1    Ohio  2001  1.7   NaN     True
2    Ohio  2002  3.6   NaN     True
3  Nevada  2001  2.4   NaN    False
4  Nevada  2002  2.9   NaN    False
5  Nevada  2003  3.2   NaN    False

In [58]:
del frame['Eastern']

In [59]:
frame

    state  year  pop  debt
0    Ohio  2000  1.5   NaN
1    Ohio  2001  1.7   NaN
2    Ohio  2002  3.6   NaN
3  Nevada  2001  2.4   NaN
4  Nevada  2002  2.9   NaN
5  Nevada  2003  3.2   NaN

In [60]:
frame.columns

Index(['state', 'year', 'pop', 'debt'], dtype='object')

In [64]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},"Nevada": {2001: 2.4, 2002: 2.9, 2042:3.3}}

In [65]:
frame3 = pd.DataFrame(populations)

In [66]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9
2042   NaN     3.3

In [67]:
frame3.T

        2000  2001  2002  2042
Ohio     1.5   1.7   3.6   NaN
Nevada   NaN   2.4   2.9   3.3

In [68]:
pd.DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [69]:
# ReIndexing
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])

In [70]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [71]:
obj.reindex(['a', 'b', 'c', 'd', 'e'])

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [72]:
 obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])

In [73]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [74]:
obj3.reindex(np.arange(6))

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [75]:
obj3.reindex(np.arange(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [76]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                       index=["a", "c", "d"],
                    columns=["Ohio", "Texas", "California"])

In [77]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [79]:
frame2= frame.reindex(index= ['a', 'b', 'c', 'd'])

In [80]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [81]:
states = ["Texas", "Utah", "California"]

In [82]:
frame.reindex(columns = states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [84]:
frame.reindex(states, axis='columns', fill_value = 'missing')

   Texas     Utah  California
a      1  missing           2
c      4  missing           5
d      7  missing           8

In [90]:
obj = pd.Series(np.arange(5), index = ['a', 'b', 'c', 'd', 'e'])

In [93]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [94]:
new_obj = obj.drop('c')

In [95]:
new_obj

a    0
b    1
d    3
e    4
dtype: int64

In [96]:
 data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                   columns=["one", "two", "three", "four"])

In [99]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [102]:
data.drop(index=['Ohio', 'Colorado'], columns='one')

          two  three  four
Utah        9     10    11
New York   13     14    15

In [101]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [108]:
data.drop('one', axis = 1)

          two  three  four
Ohio        1      2     3
Colorado    5      6     7
Utah        9     10    11
New York   13     14    15

In [109]:
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])

In [110]:
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])

In [111]:
obj1

2    1
0    2
1    3
dtype: int64

In [112]:
obj2

a    1
b    2
c    3
dtype: int64

In [114]:
obj1[[0, 1, 2]]

0    2
1    3
2    1
dtype: int64

In [115]:
obj2[[0,1,2]]

a    1
b    2
c    3
dtype: int64

In [116]:
obj2.loc[1]

KeyError: 1

In [117]:
obj2['b']

2

In [118]:
obj2

a    1
b    2
c    3
dtype: int64

In [119]:
obj2['a':'c']

a    1
b    2
c    3
dtype: int64

In [126]:
obj2.loc['b':'c'] = 7

In [127]:
obj2

a    5
b    7
c    7
dtype: int64

In [128]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [129]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [130]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [131]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [132]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [136]:
data[:2][['one', 'two']]

          one  two
Ohio        0    1
Colorado    4    5

In [137]:
data[data < 5]= 0

In [138]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [139]:
data.loc['Colorado']

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [144]:
data.loc[['Colorado', 'New York'], ['one', 'two']]

          one  two
Colorado    0    5
New York   12   13

In [145]:
ser = pd.Series(np.arange(3.))

In [146]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [147]:
ser.iloc[-1]

2.0

In [148]:
ser2 = pd.Series(np.arange(3.), index=["a", "b", "c"])

In [149]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [150]:
ser2[-1]

2.0

In [153]:
data[data['four'] > 4]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [154]:
data[data['four']>4] = 4

In [155]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    4    4      4     4
Utah        4    4      4     4
New York    4    4      4     4

In [156]:
data.loc[data.three == 5]["three"] = 6

In [157]:
data.loc[data.three == 5]

Empty DataFrame
Columns: [one, two, three, four]
Index: []

In [160]:
data.loc[data.three == 5, 'three'] =6

In [161]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    4    4      4     4
Utah        4    4      4     4
New York    4    4      4     4

In [162]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),

                   columns=list("abcd"))

In [163]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                    columns=list("abcde"))

In [164]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [165]:
df2.loc[1, 'b']

6.0

In [166]:
df2.loc[1, 'b'] = np.nan

In [167]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [170]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [171]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [172]:
df1.add(df2, fill_value= 0.)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [173]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [174]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)),
               columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])

In [175]:
frame

               b         d         e
Utah    1.317315 -0.064070 -0.956485
Ohio   -0.027072  0.497923  0.680180
Texas   0.813247 -0.501299 -0.450834
Oregon -0.840898 -0.440517 -0.287814

In [176]:
np.abs(frame)

               b         d         e
Utah    1.317315  0.064070  0.956485
Ohio    0.027072  0.497923  0.680180
Texas   0.813247  0.501299  0.450834
Oregon  0.840898  0.440517  0.287814

In [177]:
frame

               b         d         e
Utah    1.317315 -0.064070 -0.956485
Ohio   -0.027072  0.497923  0.680180
Texas   0.813247 -0.501299 -0.450834
Oregon -0.840898 -0.440517 -0.287814

In [178]:
def f1(x):
    return x.max()-x.min()

In [179]:
frame.apply(f1)

b    2.158212
d    0.999222
e    1.636665
dtype: float64

In [180]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [181]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [182]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [183]:
price  = pd.read_pickle('yahoo_price.pkl')

In [184]:
volume = pd.read_pickle('yahoo_volume.pkl')

In [185]:
returns = price.pct_change()

In [186]:
returns

                AAPL      GOOG       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023280 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897
...              ...       ...       ...       ...
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

[1714 rows x 4 columns]

In [187]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [188]:
returns['MSFT'].corr(returns['IBM'])

0.4997636114415114

In [189]:
returns['MSFT'].cov(returns['IBM'])

8.870655479703545e-05